<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
    <id>http://localhost:4000</id>
    <title>Hooyu&apos;s Note</title>
    <updated>2019-09-22T17:17:20.659Z</updated>
    <generator>https://github.com/jpmonette/feed</generator>
    <link rel="alternate" href="http://localhost:4000"/>
    <link rel="self" href="http://localhost:4000/atom.xml"/>
    <subtitle>提灯照胆看江山</subtitle>
    <logo>http://localhost:4000/images/avatar.png</logo>
    <icon>http://localhost:4000/favicon.ico</icon>
    <rights>All rights reserved 2019, Hooyu&apos;s Note</rights>
    <entry>
        <title type="html"><![CDATA[序 / INTRO]]></title>
        <id>http://localhost:4000/post/序</id>
        <link href="http://localhost:4000/post/序">
        </link>
        <updated>2019-05-02T18:06:54.000Z</updated>
        <content type="html"><![CDATA[<p>欢迎你，陌生人</p>
<p>不知不觉又咕咕咕了一年的博客，也不全因为太忙，只是自己的确没有多少的兴趣来写博客。</p>
<p>现在读了大学，学的东西多而杂，同时也对未来有了一些期待，决定重新启用博客，自己一个人悄悄的写一写东西。</p>
<p>最后，</p>
<p><strong>欢迎你来到这里</strong>。</p>
]]></content>
    </entry>
    <entry>
        <title type="html"><![CDATA[本博客搜索反代上线]]></title>
        <id>http://localhost:4000/post/本博客搜索反代上线</id>
        <link href="http://localhost:4000/post/本博客搜索反代上线">
        </link>
        <updated>2018-03-27T16:40:55.000Z</updated>
        <summary type="html"><![CDATA[<figure data-type="image" tabindex="1"><img src="https://i.loli.net/2018/03/28/5aba743212c12.jpg" alt="Google"></figure>
<blockquote>
<p>账号与密码都是上图中第一个字母小写,点<a href="https://g.ikozn.com">这里</a>访问</p>
</blockquote>
]]></summary>
        <content type="html"><![CDATA[<figure data-type="image" tabindex="1"><img src="https://i.loli.net/2018/03/28/5aba743212c12.jpg" alt="Google"></figure>
<blockquote>
<p>账号与密码都是上图中第一个字母小写,点<a href="https://g.ikozn.com">这里</a>访问</p>
</blockquote>
<!--more-->
]]></content>
    </entry>
    <entry>
        <title type="html"><![CDATA[[DCN]浅谈无线VLAN的设置]]></title>
        <id>http://localhost:4000/post/DCN-浅谈无线VLAN的设置</id>
        <link href="http://localhost:4000/post/DCN-浅谈无线VLAN的设置">
        </link>
        <updated>2018-03-12T07:22:14.000Z</updated>
        <summary type="html"><![CDATA[<p>首先我们来看一个常见的错误配置方式</p>
<h3 id="拓扑"><strong>拓扑</strong></h3>
<figure data-type="image" tabindex="1"><img src="https://i.loli.net/2018/03/12/5aa600e2bb5a2.png" alt="拓扑"></figure>
<br />
<br />
<h3 id="需求"><strong>需求</strong></h3>
<p>1.网络拓扑如上图所示，AC是无线控制器，其E1/0/1口连接着AP的LAN1口</p>
]]></summary>
        <content type="html"><![CDATA[<p>首先我们来看一个常见的错误配置方式</p>
<h3 id="拓扑"><strong>拓扑</strong></h3>
<figure data-type="image" tabindex="1"><img src="https://i.loli.net/2018/03/12/5aa600e2bb5a2.png" alt="拓扑"></figure>
<br />
<br />
<h3 id="需求"><strong>需求</strong></h3>
<p>1.网络拓扑如上图所示，AC是无线控制器，其E1/0/1口连接着AP的LAN1口</p>
<!--more-->
<p>2.按照 表1-1 完成无线网络的配置.使用户连接WLAN使能够获取对应VLAN的IP地址。AP地址通过DHCP下发，为192.168.3.10。</p>
<table>
<thead>
<tr>
<th>VLAN</th>
<th>SVI接口地址</th>
<th>说明</th>
<th>对应SSID</th>
</tr>
</thead>
<tbody>
<tr>
<td>1</td>
<td>192.168.1.254/24</td>
<td>用户VLAN</td>
<td>VLAN1-Wireless-LAB</td>
</tr>
<tr>
<td>2</td>
<td>192.168.2.254/24</td>
<td>用户VLAN</td>
<td>VLAN2-Wireless-LAB</td>
</tr>
<tr>
<td>3</td>
<td>192.168.3.254/24</td>
<td>管理 and 用户VLAN</td>
<td>VLAN3-Wireless-LAB</td>
</tr>
</tbody>
</table>
<center>表1-1</center>
<h3 id="配置及实现"><strong>配置及实现</strong></h3>
<h4 id="1ap上线">1.AP上线</h4>
<br />
<h4 id="划分vlan和设置svi接口地址">划分VLAN和设置SVI接口地址</h4>
<pre><code>AC(config)#vlan 2		//创建VLAN2
AC(config-vlan2)#vlan 3		//创建VLAN3
AC(config-vlan3)#int vlan 1 	//进入Vlan1的SVI接口
AC(config-if-vlan1)#ip ad 192.168.1.254 255.255.255.0		//设置IP地址	
AC(config-if-vlan1)#int vlan 2		//进入VLAN2的SVI接口
AC(config-if-vlan2)#ip ad 192.168.2.254 255.255.255.0		//设置IP地址
AC(config-if-vlan2)#int vlan 3		//进入VLAN3的SVI接口
AC(config-if-vlan3)#ip ad 192.168.3.254 255.255.255.0		//设置IP地址
AC(config-if-ethernet1/0/1)#sw mo trunk 		//更改接口模式为Trunk
AC(config-if-vlan3)#int e1/0/1
AC(config-if-ethernet1/0/1)#sw mo trunk 
AC(config-if-ethernet1/0/1)#switchport trunk native vlan 3		//设置Native VLAN为VLAN3
</code></pre>
<br />
<br />
<h4 id="2-开启dhcp功能自动下发地址">2 开启DHCP功能，自动下发地址。</h4>
<pre><code>AC(config)#ip dhcp pool vlan1 		//创建地址池
AC(dhcp-vlan1-config)#network-address 192.168.1.0 255.255.255.0		//设置下发网段
AC(dhcp-vlan1-config)#default-router 192.168.1.254		
AC(dhcp-vlan1-config)#!
AC(config)#ip dhcp pool vlan2		//创建地址池
AC(dhcp-vlan2-config)#network-address 192.168.2.0 255.255.255.0		//设置下发网段
AC(dhcp-vlan2-config)#default-router 192.168.2.254 		//设置网关
AC(dhcp-vlan2-config)#!
AC(config)#ip dhcp pool vlan3       //创建地址池                
AC(dhcp-vlan3-config)#network-address 192.168.3.0 255.255.255.0		//设置下发网段
AC(dhcp-vlan3-config)#default-router 192.168.3.254		//设置网关
AC(dhcp-vlan3-config)#!
AC(config)#service dhcp		//开启DHCP服务
</code></pre>
<br />
<br />
<h4 id="3-dhcp静态绑定ap地址">3 DHCP静态绑定AP地址</h4>
<p><strong>AC</strong></p>
<pre><code>AC(config)#show ip dh binding 		//查看DHCP绑定
Total dhcp binding items: 1, the matched: 1
IP address          Hardware address         Lease expiration         Type
192.168.3.1         00-03-0F-5B-F0-E0        Mon Jan 02 00:30:00 2006 Dynamic

AC(config)#ip dhcp pool AP		//添加DHCP池
AC(dhcp-ap-config)#hardware-address 00-03-0F-5B-F0-E0		//绑定MAC地址
AC(dhcp-ap-config)#host 192.168.3.10		//绑定IP
AC(dhcp-ap-config)#default-router 192.168.3.254		//设置网关
AC(dhcp-ap-config)#!
AC(config)#show ip dh binding                
Total dhcp binding items: 1, the matched: 1
IP address          Hardware address         Lease expiration         Type
192.168.3.10        00-03-0F-5B-F0-E0        Infinite                 Manual
</code></pre>
<br />
<br />
<p><strong>AP</strong></p>
<p>重启的DHCP功能</p>
<pre><code>AP# set management dhcp-status down	//关闭DHCP获取地址
AP# set management dhcp-status up  	//开启DHCP获取地址
AP# get management 
Property                   Value
--------------------------------------------
vlan-id                    1
interface                  brvlan1
static-ip                  192.168.1.10
static-mask                255.255.255.0
ip                         192.168.3.10		//获取到了192.168.3.10
mask                       255.255.255.0
ipv6                       
ipv6-prefix-length         0
mac                        00:03:0F:5B:F0:E0
dhcp-status                up
dhcpv6-status              down
ipv6-status                up
ipv6-autoconfig-status     up
static-ipv6                
static-ipv6-prefix-length  0
</code></pre>
<br />
<br />
<h4 id="4-开启ac无线功能">4 开启AC无线功能</h4>
<pre><code>AC(config-wireless)#no auto-ip-assign 		//关闭无线地址选举
AC(config-wireless)#static-ip 192.168.3.254		//设置静态无线地址
AC(config-wireless)#discovery vlan-list 3		//设置二层发现VLAN
AC(config-wireless)#ap authentication none 		//关闭AP验证
AC(config-wireless)#enable 		//开启无线功能
查看AP状态
AC(config)#show wir ap status 

    MAC Address                                                            Configuration                
 (*) Peer Managed  IP Address                              Profile Status     Status           Age      
------------------ --------------------------------------- ------- ------- ------------- --------------
 00-03-0f-5b-f0-e0 192.168.3.10                            1       Managed Failure       0d:00:00:07

Total Access Points............................ 1
</code></pre>
<br />
<br />
<h4 id="5-无线配置">5 无线配置</h4>
<pre><code>AC(config)#wireless 		//进入无线全局模式
AC(config-wireless)#network 1		//进入network配置模式
AC(config-network)#ssid VLAN1-Wireless-LAB		//设置SSID
AC(config-network)#security mode none 	//关闭用户认证
AC(config-network)#vlan 1		//设置VLAN
AC(config-network)#network 2		//进入network配置模式
AC(config-network)#ssid VLAN2-Wireless-LAB
AC(config-network)#security mode none 		//关闭用户认证
AC(config-network)#vlan 2		//设置VLAN
AC(config-network)#network 3		//进入network配置模式
AC(config-network)#ssid VLAN3-Wireless-LAB
AC(config-network)#security mode none 		//关闭用户认证
AC(config-network)#vlan 3		//设置VLAN
AC(config-network)#!
AC(config-wireless)#ap profile 1		//进入profile 1
AC(config-ap-profile)#hwtype 29		//设置硬件号
AC(config-ap-profile)#radio 1		//进入radio配置模式
AC(config-ap-profile-radio)#vap 1		//进入vap配置模式
AC(config-ap-profile-vap)#enable 		//开启vap
AC(config-ap-profile-vap)#vap 2		//进入VAP配置模式
AC(config-ap-profile-vap)#enable 	//开启VAP
AC(config-ap-profile-vap)#!
AC(config-ap-profile-radio)#!
AC(config-ap-profile)#!
AC(config-wireless)#!
AC(config)#!
AC(config)#exit
AC#wir ap prof ap 1		//下发配置文件
All configurations will be send to the aps associated to this profile and associated clients on these aps will be disconnected. Are you sure you want to apply the profile configuration? [Y/N] y
</code></pre>
<hr>
<h4 id="6测试">6.测试</h4>
<p>配置文件下发之后，稍等一会，就可以搜索到无线信号了。</p>
<figure data-type="image" tabindex="2"><img src="https://i.loli.net/2018/03/12/5aa57b1fe9738.png" alt="WIFI列表"></figure>
<p>接着我们连上去试试</p>
<p>首先我们连接VLAN1的</p>
<p>结果发现</p>
<figure data-type="image" tabindex="3"><img src="https://i.loli.net/2018/03/12/5aa57c1f5f96d.png" alt="VLAN1连接"></figure>
<center>竟然获取到了VLAN3的地址</center>
<br />
<center>接下来我们再连接VLAN2的试试</center>
<figure data-type="image" tabindex="4"><img src="https://i.loli.net/2018/03/12/5aa57c1f5f96d.png" alt="VLAN2连接"></figure>
<center>发现是正常的</center>
<br />
<center>最后再来连接VLAN3</center>
<figure data-type="image" tabindex="5"><img src="https://i.loli.net/2018/03/12/5aa58ea17ceb9.png" alt="VLAN3连接"></figure>
<center>发现根本获取不到IP地址</center>
<h3 id="问题分析">问题分析</h3>
<h4 id="1拓扑">1.拓扑</h4>
<figure data-type="image" tabindex="6"><img src="https://i.loli.net/2018/03/12/5aa600e2bb5a2.png" alt="拓扑"></figure>
<br />
<br />
<h4 id="2vlan-1-用户上线过程">2.VLAN 1 用户上线过程</h4>
<figure data-type="image" tabindex="7"><img src="https://i.loli.net/2018/03/12/5aa600abe2514.png" alt="VLAN DHCP过程"></figure>
<p>**(1).**当用户连接到无线网络之后，客户端发送<code>DHCP DISCOVER</code>广播包来请求IP地址</p>
<p>**(2).**AP默认的转发方式为本地转发，所以<code>DHCP DISCOVER</code>报文到达AP之后802.11帧便被转换成以太网帧。不打VLAN TAG，将数据包转发给交换机。</p>
<p>**(3).**我们在交换机的E1/0/1接口上配置了命令 <code>switchport trunk native vlan 3</code>,所以当没有VLAN Tag的帧到达交换机的时候，被打上VLAN 3的标签.</p>
<p>**(4).**所以最后导致了Client获取到了VLAN3网段的地址</p>
<blockquote>
<p>VLAN1的数据AP不打标签</p>
</blockquote>
<br />
<br />
<h4 id="3vlan-2-用户上线过程">3.VLAN 2 用户上线过程</h4>
<figure data-type="image" tabindex="8"><img src="https://i.loli.net/2018/03/12/5aa601ee7c5d5.png" alt="VLAN2上线"></figure>
<p>**(1).**当用户连接到无线网络之后，客户端发送<code>DHCP DISCOVER</code>广播包来请求IP地址</p>
<p>**(2).**AP默认的转发方式为本地转发，所以<code>DHCP DISCOVER</code>报文到达AP之后802.11帧便被转换成以太网帧。</p>
<p>打上<code>VLAN 2</code> TAG，将数据包转发给交换机。</p>
<p>**(3).**交换机收到该帧，不对帧进行任何处理，直接放行，最后帧在VLAN2内传播。</p>
<p>**(4).**所以客户机可以获取到正确的地址。</p>
<br />
<br />
<h4 id="4vlan-3-用户上线过程">4.VLAN 3 用户上线过程</h4>
<figure data-type="image" tabindex="9"><img src="https://i.loli.net/2018/03/12/5aa60313a8a84.png" alt="VLAN3上线"></figure>
<p>**(1).**当用户连接到无线网络之后，客户端发送<code>DHCP DISCOVER</code>广播包来请求IP地址</p>
<p>**(2).**AP默认的转发方式为本地转发，所以<code>DHCP DISCOVER</code>报文到达AP之后802.11帧便被转换成以太网帧。</p>
<p>**(3).**打上<code>VLAN 3</code> TAG，将数据包转发给交换机，然而交换机上配置了<code>switchport trunk native vlan 3</code>，导致交换机丢包，该SSID下所有数据都不能通过交换机，所以最终也不能获取地址。</p>
<br />
<br />
<hr>
<h3 id="解决问题">解决问题</h3>
<p>让我们重新做一遍</p>
<h4 id="1设置vlan">1.设置VLAN</h4>
<pre><code>AC(config)#vlan 2		//创建VLAN2
AC(config-vlan2)#vlan 3		//创建VLAN3
AC(config-vlan3)#int vlan 1 	//进入Vlan1的SVI接口
AC(config-if-vlan1)#ip ad 192.168.1.254 255.255.255.0		//设置IP地址	
AC(config-if-vlan1)#int vlan 2		//进入VLAN2的SVI接口
AC(config-if-vlan2)#ip ad 192.168.2.254 255.255.255.0		//设置IP地址
AC(config-if-vlan2)#int vlan 3		//进入VLAN3的SVI接口
AC(config-if-vlan3)#ip ad 192.168.3.254 255.255.255.0		//设置IP地址
AC(config-if-vlan3)#int e1/0/1
AC(config-if-ethernet1/0/1)#sw mo trunk 		//更改接口模式为Trunk
</code></pre>
<p><strong>注意，这里不设置Native VLAN</strong></p>
<br />
<br />
<h4 id="2设置dhcp">2.设置DHCP</h4>
<p><strong>AP</strong></p>
<p>设置管理VLAN</p>
<pre><code>AP# set management vlan-id 3	//设置管理VLAN为VLAN3
</code></pre>
<blockquote>
<p>设置管理VLAN之后，从AP发出的管理/控制报文都会打上VLAN 3的TAG，也可以接受带VLAN3 TAG的管理报文。</p>
</blockquote>
<br />
<br />
<p><strong>AC</strong></p>
<pre><code>AC(config)#ip dh pool VLAN1
AC(dhcp-vlan1-config)#network-address 192.168.1.0 255.255.255.0
AC(dhcp-vlan1-config)#default-router 192.168.1.254
AC(dhcp-vlan1-config)#!                    
AC(config)#ip dh pool VLAN2
AC(dhcp-vlan2-config)#network-address 192.168.2.0 255.255.255.0
AC(dhcp-vlan2-config)#default-router 192.168.2.254
AC(dhcp-vlan2-config)#!
AC(config)#ip dh pool VLAN3
AC(dhcp-vlan3-config)#network-address 192.168.3.0 255.255.255.0
AC(dhcp-vlan3-config)#default-router 192.168.3.254
AC(dhcp-vlan3-config)#!
AC(config)#service dhcp
</code></pre>
<br />
<br />
<h4 id="3静态绑定dhcp">3.静态绑定DHCP</h4>
<p><strong>AC</strong></p>
<pre><code>AC(config)#show ip dh binding 
Total dhcp binding items: 1, the matched: 1
IP address          Hardware address         Lease expiration         Type
192.168.3.1         aa-aa-aa-aa-aa-aa        Mon Jan 02 00:12:00 2006 Dynamic
AC(config)#ip dhcp pool AP
AC(dhcp-ap-config)#hardware-address aa-aa-aa-aa-aa-aa
AC(dhcp-ap-config)#host 192.168.3.10
AC(dhcp-ap-config)#default-router 192.168.3.254
AC(dhcp-ap-config)#!
</code></pre>
<br />
<p><strong>AP</strong></p>
<pre><code>AP# set management dhcp-status down
AP# set management dhcp-status up  
</code></pre>
<br />
<br />
<h4 id="4开启无线功能">4.开启无线功能</h4>
<pre><code>AC(config-wireless)#no auto-ip-assign 
AC(config-wireless)#static-ip 192.168.3.254
AC(config-wireless)#ap authe none 
AC(config-wireless)#discovery vlan-list 3
AC(config-wireless)#enable 
</code></pre>
<br />
<br />
<h4 id="5配置无线">5.配置无线</h4>
<pre><code>AC(config-wireless)#network 1
AC(config-network)#ssid VLAN1-Wireless-LAB
AC(config-network)#vlan 1
AC(config-network)#network 2
AC(config-network)#ssid VLAN2-Wireless-LAB
AC(config-network)#vlan 2
AC(config-network)#network 3
AC(config-network)#ssid VLAN3-Wireless-LAB
AC(config-network)#vlan 3
AC(config-network)#!
AC(config-wireless)#ap profile 1
AC(config-ap-profile)#hwtype 29
AC(config-ap-profile)#management vlan 3
AC(config-ap-profile)#radio 1
AC(config-ap-profile-radio)#vap 1
AC(config-ap-profile-vap)#enable 
AC(config-ap-profile-vap)#vap 2
AC(config-ap-profile-vap)#enable 
AC(config-ap-profile-vap)#!
AC(config-ap-profile-radio)#!
AC(config-ap-profile)#!
AC#wireless ap prof ap 1
All configurations will be send to the aps associated to this profile and associated clients on these aps will be disconnected. Are you sure you want to apply the profile configuration? [Y/N] y
AP Profile apply is in progress.
</code></pre>
<br />
<br />
<h4 id="6测试-2">6.测试</h4>
<p><strong>VLAN1</strong></p>
<figure data-type="image" tabindex="10"><img src="https://i.loli.net/2018/03/12/5aa60f0615b3b.png" alt="VLAN1"></figure>
<br />
<br />
<p><strong>VLAN2</strong></p>
<figure data-type="image" tabindex="11"><img src="https://i.loli.net/2018/03/12/5aa60f8f5b204.png" alt="VLAN2"></figure>
<p><strong>VLAN3</strong></p>
<figure data-type="image" tabindex="12"><img src="https://i.loli.net/2018/03/12/5aa61045a552d.png" alt="VLAN3"></figure>
<p>可以发现，这次一切都正常了。</p>
<hr>
<h3 id="失误发生的原因">失误发生的原因</h3>
<p>这个配置错误出现的原因主要有以下两点:</p>
<p>**1.**对<code>network</code>配置模型下<code>vlan</code>的命令有所误解</p>
<p>这个命令是设置VLAN表示，设置无线用户的数据在经过AP之后应打上的VLAN TAG，而不是说这个无线信号数据是哪个VLAN，就设置成哪个VLAN。</p>
<br />
<br />
<p>**2.**无线管理VLAN的设置</p>
<p>一般来说，我们设置管理VLAN的时候都是将接口设置为Trunk，并更改接口的本征VLAN.大多数情况下这样子是没有问题的.但是当管理VLAN和用户VLAN是同一个，并且不是VLAN1的时候，情况就有些尴尬.</p>
<p>如上面的第一个实验，当管理和用户VLAN都是VLAN3的时候，我们一般都是这么设置的:</p>
<pre><code>AC(config-if-vlan3)#int e1/0/1
AC(config-if-ethernet1/0/1)#sw mo trunk 
AC(config-if-ethernet1/0/1)#switchport trunk native vlan 3		//设置Native VLAN为VLAN3
</code></pre>
<p><em><strong>更改接口的本征VLAN</strong></em></p>
<br />
<br />
<pre><code>AC(config-network)#network 3		//进入network配置模式
AC(config-network)#ssid VLAN3-Wireless-LAB
AC(config-network)#security mode none 		//关闭用户认证
AC(config-network)#vlan 3		//设置VLAN
</code></pre>
<p><em><strong>在Network下设置VLAN标识</strong></em></p>
<p>如果这么设置，AP转发连接到Network 3的用户流量的时候，就会打上VLAN 3的TAG并发送出去，然而我们的AC接口也将接口的本征VLAN修改为了VLAN3。一但AC收到AP发来带有VLAN 3 TAG的数据帧时，就会将帧丢弃，这就这就导致了我们连上了Network 3却无法访问网络.</p>
<br />
<br />
<p>解决方法有两种</p>
<p>**1.**将network中的vlan标识改回vlan1</p>
<p>如此，当AP转发Network的流量时，就不会打上VLAN TAG，AC接收到数据帧之后，会根据本征VLAN打上VLAN TAG，然后在AC中进行转发。</p>
<p>此方法的代价就是VLAN1不能用来转发无线流量(不能当做用户VLAN).</p>
<br />
<p>**2.**请看[解决问题]篇</p>
<h3 id="总结">总结</h3>
<p>当你的管理VLAN与用户VLAN是同一个VLAN且不是VLAN1的时候，要么放弃使用VLAN1转发数据。</p>
<p>要么在AP上设置管理VLAN.</p>
]]></content>
    </entry>
    <entry>
        <title type="html"><![CDATA[[DCN]神州数码无线常用配置]]></title>
        <id>http://localhost:4000/post/无线常用配置</id>
        <link href="http://localhost:4000/post/无线常用配置">
        </link>
        <updated>2018-03-11T15:21:33.000Z</updated>
        <summary type="html"><![CDATA[<h3 id="ap管理">AP管理</h3>
<h4 id="ac发现ap">AC发现AP</h4>
<h5 id="二层发现">二层发现</h5>
<pre><code>DCWS-6028(P)(config-wireless)#discovery vlan-list 1 //指定VLAN发现列表
DCWS-6028(P)(config-wireless)# ap database xx-xx-xx-xx-xx-xx  //添加AP MAC地址
</code></pre>
]]></summary>
        <content type="html"><![CDATA[<h3 id="ap管理">AP管理</h3>
<h4 id="ac发现ap">AC发现AP</h4>
<h5 id="二层发现">二层发现</h5>
<pre><code>DCWS-6028(P)(config-wireless)#discovery vlan-list 1 //指定VLAN发现列表
DCWS-6028(P)(config-wireless)# ap database xx-xx-xx-xx-xx-xx  //添加AP MAC地址
</code></pre>
<!--more-->
<h5 id="三层发现">三层发现</h5>
<h4 id="ap发现ac">AP发现AC</h4>
<p><em><strong>AP配置</strong></em></p>
<pre><code>DCN-WLAN-AP# set management static-ip 192.168.2.1  //配置静态IP
DCN-WLAN-AP# set management static-mask 255.255.255.0  //配置掩码
DCN-WLAN-AP# set static-ip-route gateway 192.168.2.2   //配置默认网关
</code></pre>
<p><em><strong>AC配置</strong></em></p>
<pre><code>DCWS-6028(P)(config-wireless)# discovery ip-list 192.168.2.1  //指定AP IP
DCWS-6028(P)(config-wireless)# ap database xx-xx-xx-xx-xx-xx  //添加AP MAC地址
</code></pre>
<h5 id="ap静态发现">AP静态发现</h5>
<pre><code>DCN-WLAN-AP# set managed-ap switch-address-1 192.168.1.1	//设置第一个AC地址
DCN-WLAN-AP# set managed-ap switch-address-2 192.168.2.2	//设置第二个AC地址
</code></pre>
<h5 id="option下发ac地址">Option下发AC地址</h5>
<pre><code>DCWS(config)#ip dhcp pool ap
DCWS(dhcp-ap-config)#option 43 hex 01040A090005	//0104为固定值，后接IP地址16进制
</code></pre>
<h4 id="ap认证">AP认证</h4>
<h5 id="无验证">无验证</h5>
<pre><code>DCWS(config-wireless)#ap authentication none
</code></pre>
<h5 id="mac地址验证">MAC地址验证</h5>
<pre><code>DCWS(config-wireless)#ap authe mac //设置AP验证方式为mac地址验证
DCWS(config-wireless)#ap database xx-xx-xx-xx-xx-xx //手动添加AP database 条目
</code></pre>
<h5 id="密码验证">密码验证</h5>
<p><em><strong>AP配置</strong></em></p>
<pre><code>AP# set managed-ap pass-phrase 12345678	//设置认证密码
</code></pre>
<p><em><strong>AC配置</strong></em></p>
<pre><code>DCWS(config-wireless)#ap authentication pass-phrase 
DCWS(config-wireless)#ap database xx-xx-xx-xx-xx-xx            
DCWS(config-ap)#password plain 12345678	//设置AP认证密码
</code></pre>
<h5 id="序列号认证">序列号认证</h5>
<p><em><strong>AP操作</strong></em></p>
<pre><code>AP# get system 
Property          Value
---------------------------------------------------------------
model             Wireless Infrastructure Platform Reference AP
version           2.0.20.15
altversion        2.0.20.15
protocol-version  2
base-mac          xx:xx:xx:xx:xx:xx
serial-number     WL013210FA24000118	//序列号
system-name       
system-contact    
system-location   
apmode            fit
</code></pre>
<p><em><strong>AC操作</strong></em></p>
<pre><code>AC(config)#wireless 
AC(config-wireless)# ap authentication serial-num
AC(config-wireless)# ap database xx-xx-xx-xx-xx-xx 
AC(config-ap)#serial-num WL013210FA24000118
</code></pre>
<h4 id="ap逃生">AP逃生</h4>
<pre><code>DCWS(config-wireless)#ap prof 1
DCWS(config-ap-profile)#ap escape //开启AP逃生模式
</code></pre>
<h4 id="修改ap配置文件">修改AP配置文件</h4>
<pre><code>AC(config-ap)#profile 3 //在AP配置模式下()
</code></pre>
<h4 id="修改ap管理vlan">修改AP管理VLAN</h4>
<pre><code>AC(config-ap-profile)#management vlan 4094 
AC(config-ap-profile)#wireless ap profile apply 1
</code></pre>
<hr>
<h3 id="用户接入">用户接入</h3>
<h4 id="用户认证方式">用户认证方式</h4>
<h5 id="wep认证">WEP认证</h5>
<pre><code>DCWS(config-network)#Sec mode static-wep 	//设置认证方式为WEP
DCWS(config-network)#wep key length 64		//设置key长度，64为5位，128为13位
DCWS(config-network)#wep key type ascii		//设置WEP密钥类型
DCWS(config-network)#wep key  1 12345		//设置WEP密钥
</code></pre>
<h5 id="wpa个人版">WPA个人版</h5>
<pre><code>DCWS(config-wireless)#network 1
DCWS(config-network)#Sec mode wpa-per 	//设置认证方式为WPA个人版
DCWS(config-network)#wpa ciphers tkip 	//设置WPA加密方式为Tkip
DCWS(config-network)#wpa key tikp123456789	//设置WPA密钥
</code></pre>
<h5 id="wpa企业版">WPA企业版</h5>
<p><em><strong>认证服务器配置</strong></em></p>
<blockquote>
<p>略</p>
</blockquote>
<p><em><strong>AC配置</strong></em></p>
<pre><code>DCWS(config)#dot1x enable      //开启dot1x认证
DCWS(config)#radius-server authentication host 172.16.5.164 key 0 123 //设置服务器地址和key
DCWS(config)#radius source-ipv4 172.16.5.233  //设置源地址
DCWS(config)#radius nas-ipv4 172.16.5.233     //设置NAS地址
DCWS(config)#aaa enable
DCWS(config)#!
DCWS(config)#aaa group server radius 2012    //设置AAA组
DCWS(config-sg-radius)# server 172.16.5.164    //添加服务器
DCWS(config-sg-radius)#!
DCWS(config)#wireless
DCWS(config-wireless)# radius server-name auth 2012 //调用AAA服务器组
DCWS(config-wireless)# network 1
DCWS(config-network)#  radius server-name auth 2012    //调用AAA服务器组
DCWS(config-network)#  security mode wpa-enterprise    //设置无线企业认证
DCWS(config-network)#  ssid radius
DCWS(config-network)#  vlan 20
DCWS(config-network)#!
</code></pre>
<h4 id="本地portal认证">本地Portal认证</h4>
<pre><code>AC(config)#captive-portal    //进入captive-portal模式
AC(config-cp)#enable    //开启Protal功能
AC(config-cp)#authentication-type internal    //认证类型为内置Protal
AC(config-cp)#user user1    //创建并设置用户 user1
AC(config-cp-local-user)#password 123456    //设置账户的密码为 123456
AC(config-cp-local-user)#group 0    //用户加入组 group 0
AC(config-cp-local-user)#!
AC(config-cp)#configuration 1    //进入captive-portal 配置1
AC(config-cp-instance)#enable    //开启此配置
AC(config-cp-instance)#verification local    //设置验证模式为本地
AC(config-cp-instance)#group 0    //绑定Group 0 组
AC(config-cp-instance)#auth-method mac-ip-based    //设置认证方式为基于MAC-IP
AC(config-cp-instance)#interface ws-network 1    //绑定无线网络 (对应配置下发时的 Network 对应一个VAP)
</code></pre>
<h4 id="动态黑名单">动态黑名单</h4>
<pre><code>DCWS(config-wireless)#dynamic-blacklist //开启动态黑名单功能
DCWS(config-wireless)#network 1
DCWS(config-network)#mac authentication local //开启MAC本地验证
</code></pre>
<h4 id="mac认证">MAC认证</h4>
<blockquote>
<p>只允许已添加MAC的终端连接AP，或阻止已添加MAC的终端连接AP</p>
</blockquote>
<p>只允许已添加MAC的终端连接AP</p>
<pre><code>DCWS-6028(config-wireless)#mac-authentication-modewhite-list	//开启MAC白名单模式
DCWS-6028(config-wireless)#known-client 00-11-11-11-11-11 action global-action	//添加MAC地址
DCWS-6028(config-wireless)#network 1
DCWS-6028(config-network)#mac authentication local	//开启MAC本地认证
</code></pre>
<p>阻止已添加MAC的终端连接AP</p>
<pre><code>DCWS-6028(config-wireless)#mac-authentication-modeblack-list	//开启黑名单模式
DCWS-6028(config-wireless)#known-client 00-22-22-22-22-22action global-action	//添加MAC地址
DCWS-6028(config-wireless)#network 1
DCWS-6028(config-network)#mac authentication local	//开启MAC本地认证
</code></pre>
<p>配置完成后需下发AP生效</p>
<pre><code>DCWS-6028#wireless approfile apply 1
</code></pre>
<h4 id="最大接入用户数">最大接入用户数</h4>
<p>最大接入10个用户</p>
<pre><code>DCWS(config-network)#max-clients 10 
</code></pre>
<p>用户老化时间为300秒</p>
<pre><code>DCWS(config-network)#offline-detect idle-timeout 300
</code></pre>
<h4 id="限制接入时间">限制接入时间</h4>
<p>星期一 09:00 到 18:00 不允许接入无线网络</p>
<pre><code>DCWS(config-network)#time-limit from 09:00 to 18:00 weekday monday 
</code></pre>
<h4 id="arp抑制">ARP抑制</h4>
<pre><code>AC(config)# wireless 
AC(config-wireless)#network 1 
AC(config-network)# arp-suppression
</code></pre>
<h4 id="anti-flood">Anti-flood</h4>
<p>防止AP泛洪攻击，检测时间为10分钟，最大连接次数为5次，老化时间为60分钟</p>
<pre><code>AC(config-wireless)# wireless ap anti-flood
AC(config-wireless)# wireless ap anti-flood interval 10
AC(config-wireless)# wireless ap anti-flood max-conn-count 5
AC(config-wireless)# wireless ap anti-flood agetime 60
</code></pre>
<h4 id="隐藏ssid">隐藏SSID</h4>
<pre><code>DCWS(config-network)#hide-ssid 
</code></pre>
<hr>
<h3 id="射频管理">射频管理</h3>
<h4 id="调整射频工作模式">调整射频工作模式</h4>
<pre><code>DCWS-6028(config-wireless)#ap profile 1
DCWS-6028(config-ap-profile)#radio 1
DCWS-6028(config-ap-profile-radio)#mode bg-n
</code></pre>
<h4 id="设置ap的功率和信道">设置AP的功率和信道</h4>
<p>调整完需重启AP生效</p>
<pre><code>DCWS-6028(config-wireless)#ap database 00-03-0f-19-71-e0
DCWS-6028(config-ap)#radio 1 channel 11
The valid AP entry is updated. This AP is already managed, to update the managed AP configuration with the new value(s) you need to reset the AP.
DCWS-6028(config-ap)#radio 1 power 50
</code></pre>
<h4 id="自动信道调整">自动信道调整</h4>
<blockquote>
<p>自动信道调整有三种方式：手动触发、周期性触发和固定时间触发</p>
<p>如果为AP设置了固定信道，则不能对此AP进行自动信道调整</p>
<p>自动信道调整功能默认是开启的</p>
</blockquote>
<h5 id="手动触发方式">手动触发方式</h5>
<pre><code>DCWS-6028(config-wireless)#channel-planbgn mode manual 
DCWS-6028#wireless channel-plan bgnstart
wirelessCalculate80211ChannelAdjustment successfuly added proposed entry to ap=00-03-0f-19-71-e0
  
DCWS-6028#wirelesschannel-plan bgn apply
</code></pre>
<h5 id="周期性触发方式">周期性触发方式</h5>
<pre><code>DCWS-6028(config-wireless)#channel-plan bgnmode interval
DCWS-6028(config-wireless)#channel-plan bgninterval 720
</code></pre>
<h5 id="固定时间触发方式">固定时间触发方式</h5>
<pre><code>DCWS-6028(config-wireless)#channel-plan bgnmode time
DCWS-6028(config-wireless)#channel-plan bgntime 23:00
</code></pre>
<h4 id="自动功率调整">自动功率调整</h4>
<blockquote>
<p>自动功率调整有两种方式：手动触发和周期性触发</p>
<p>如果为AP配置了固定功率，则不能对此AP进行自动功率调整</p>
</blockquote>
<h5 id="手动触发方式-2">手动触发方式</h5>
<pre><code>DCWS-6028(config-wireless)#ap profile 1
DCWS-6028(config-ap-profile)#radio 1
DCWS-6028(config-ap-profile-radio)#power auto 
DCWS-6028(config-wireless)#power-plan mode manual
DCWS-6028#wireless power-plan start
DCWS-6028#wireless power-plan apply
</code></pre>
<h5 id="周期性触发方式-2">周期性触发方式</h5>
<pre><code>DCWS-6028(config-wireless)#approfile 1
DCWS-6028(config-ap-profile)#radio 1
DCWS-6028(config-ap-profile-radio)#power auto 
DCWS-6028(config-ap-profile-radio)#exit
DCWS-6028(config-ap-profile)#exit
DCWS-6028(config-wireless)#power-plan mode interval 
DCWS-6028(config-wireless)#power-plan interval 720
</code></pre>
<h4 id="支持速率集">支持速率集</h4>
<pre><code>AC(config- ap-profile-radio)#mode bg 
AC(config- ap-profile-radio)#rate basic 54 //设置基本速率集
DCWS(config-ap-profile-radio)#rate supported 54 //设置支持速率集
</code></pre>
<hr>
<h3 id="流量转发">流量转发</h3>
<h4 id="无线隔离">无线隔离</h4>
<p>同一SSID(同一VLAN)下无线隔离</p>
<pre><code>DCWS(config-wireless)#network 1
DCWS(config-network)#station-isolation 
</code></pre>
<p>同一radio下用户隔离</p>
<pre><code>DCWS(config-wireless)#ap profile 1
DCWS(config-ap-profile)#radio 1
DCWS(config-ap-profile-radio)#station-isolation
</code></pre>
<h4 id="无线强制漫游">无线强制漫游</h4>
<pre><code>DCWS(config-wireless)#force-roaming mode auto //开启自动强制漫游功能
DCWS(config-wireless)#force-roaming mode auto interval 15  //自动强制漫游功能的执行周期为15分钟。
DCWS(config-wireless)#force-roaming rssi-threshold 10   //设置RSSI阈值，为10%
DCWS(config-wireless)#force-roaming denial-count 5       //设置自动强制漫游拒绝次数门限为5次
DCWS(config-wireless)#force-roaming denial-timeout 1  //设置拒绝次数门限老化为1小时
DCWS(config-wireless)#force-roaming hysteresis 4    //设置符合强制漫游的信号强度差值为4%.
DCWS#wireless force-roaming client aa-aa-aa-aa-aa-aa start  //手动发起漫游功能
</code></pre>
<h4 id="分布式转发">分布式转发</h4>
<pre><code>DCWS-6028(P)(config-network)#dist-tunnel //该Network的流量开启分布式转发
</code></pre>
<h4 id="集中转发">集中转发</h4>
<pre><code>DCWS(config-wireless)#l2tunnel vlan-list add 10;20	//设置VLAN10 VLAN20的流量为集中转发
</code></pre>
<h4 id="限速">限速</h4>
<pre><code>DCWS(config-wireless)#ap client-qos	//开启AP QoS
DCWS(config-wireless)#network 1
DCWS(config-network)#client-qos bandwidth-limit down 5120	//限速下行速率为5Mb/s
DCWS(config-network)#client-qos bandwidth-limit up 2048		//限速上行速率为2Mb/s
</code></pre>
<h4 id="时空公平调度">时空公平调度</h4>
<pre><code>DCWS(config-ap-profile-radio)#schedule-mode preferred	//开启时空公平调度
</code></pre>
<hr>
<h3 id="常用维护命令">常用维护命令</h3>
<h4 id="ac常用维护命令">AC常用维护命令</h4>
<p><strong>查看AP的注册和配置状态</strong></p>
<pre><code>DCWS-6028#show wireless ap status 
	    MAC Address                                            Configuration                
	 (*) Peer Managed  IP Address Profile Status     Status           Age      
	------------------ --------------- ------- ------- ------------- -------------- -------------
	 00-03-0f-19-71-e0 192.168.1.10    1  Managed Success   d:00:00:01
	Total Access Points............................ 1

</code></pre>
<p><strong>查看AP的注册失败信息</strong></p>
<pre><code>DCWS-6028#show wireless ap failure status
</code></pre>
<p><strong>下发配置</strong></p>
<pre><code>DCWS-6028#wireless approfile apply 1
</code></pre>
<p><strong>设置硬件类型</strong></p>
<pre><code>DCWS(config-ap-profile)#hwtype 29
</code></pre>
<p><strong>查看硬件版本</strong>1</p>
<pre><code>DCWS(config-ap-profile)#show wir ap 00-03-0f-5b-f0-e0 status | i Type
Hardware Type.................................. 29 - WL8200-I2, Indoor Dual Radio a/n/ac, b/g/n
CPU Type....................................... AR9344-533
</code></pre>
<p><strong>查看硬件版本2</strong></p>
<pre><code>DCWS#show vendor | i WL8200-I2
                          29 WL8200-I2        R1    WL8200-I2, Indoor Dual Radio a/n/ac, b/g/n
</code></pre>
<p>查看AC的无线状态，可以看到无线功能是否开启，无线IP地址信息，国家代码信息，管理的AP数量等</p>
<pre><code>DCWS-6028# show wireless 
DCWS-6028# show wireless status
</code></pre>
<p>查看AP的详细信息，可以看到AP的MAC地址、IP地址、硬件类型及型号、软件版本、序列号等</p>
<pre><code>DCWS-6028#showwireless ap 00-03-0f-19-71-e0 status 
  MACaddress.................................... 00-03-0f-19-71-e0
  Location.......................................
  IPAddress..................................... 192.168.1.10
  IP SubnetMask................................. 255.255.255.0
  … …
</code></pre>
<p>查看AP的射频信息</p>
<pre><code>DCWS-6028#show wireless ap radio status 
	 DCWS-6028#show wireless ap 00-03-0f-19-71-e0 radio status 
	     MAC Address                                                     Transmit     Auth. 
	 (*) Peer Managed   Location        Radio Channel Power (%) Clients
	     ------------------       -----------          -----       -------    --------         -------
	 00-03-0f-19-71-e0                           1           11          100            0      
                                                                  2          149         100            0

</code></pre>
<p>查看无线终端信息</p>
<pre><code>DCWS-6028#show wireless client status      
	   MAC Address                                                             
	 (*) Peer Managed  VAP MAC Address SSID  Status Network Time 
 	     ------------------            -----------------          -------   ---------      -----------
	 00-1c-bf-21-85-90 00-03-0f-19-71-e1       wlan    Auth    0d:00:00:05
	Total Clients Associated To Local Switch....... 1
	Total Clients Associated To Peer Switches...... 0
</code></pre>
<p>重启AP，可以重启所有AP，也可以单独重启某一台AP</p>
<pre><code>DCWS-6028#wireless ap reset
DCWS-6028#wireless ap reset 00-03-0f-19-71-e0
</code></pre>
<h4 id="ap常用维护命令">AP常用维护命令</h4>
<p><strong>获取地址信息</strong></p>
<pre><code>AP# get management 
Property                   Value
--------------------------------------------
vlan-id                    1
interface                  brvlan1
static-ip                  192.168.2.1
static-mask                255.255.255.0
ip                         192.168.2.1
mask                       255.255.255.0
ipv6                       
ipv6-prefix-length         0
mac                        xx:xx:xx:xx:xx:xx
dhcp-status                up
dhcpv6-status              up
ipv6-status                up
ipv6-autoconfig-status     up
static-ipv6                
static-ipv6-prefix-length  0
</code></pre>
<p><strong>设置IP地址信息</strong></p>
<pre><code>AP# set management static-ip 192.168.2.1 //设置IP
AP# set static-ip-route management gateway 192.168.2.254    //配置网关
AP# set management static-mask 255.255.255.0  //设置掩码
AP# set management dhcp-status down //关闭DHCP
AP# set management dhcp-status up   //开启DHCP
AP# set managed-ap switch-address-1 1.1.1.1 //设置主AC地址
AP# set managed-ap switch-address-2 2.2.2.2 //设置备用AC地址
AP# set managed-ap switch-address-2 3.3.3.3 //设置备用AC地址
</code></pre>
<p><strong>设置管理VLAN</strong></p>
<pre><code>AP# set management vlan-id 1
</code></pre>
<p>**重置AP **</p>
<pre><code>DCN-WLAN-AP# factory-reset 
</code></pre>
<p>瘦AP转胖AP</p>
<pre><code>AP#switch-apmode fat
</code></pre>
<p>胖AP转瘦AP</p>
<pre><code>AP#switch-apmode fit
</code></pre>
<hr>
<h3 id="配置原则关系图解">配置原则关系图解</h3>
<figure data-type="image" tabindex="1"><img src="https://i.loli.net/2018/03/11/5aa536dc8b2bb.png" alt="无线配置原则"></figure>
]]></content>
    </entry>
    <entry>
        <title type="html"><![CDATA[ 我回来啦]]></title>
        <id>http://localhost:4000/post/我胡汉三回来了</id>
        <link href="http://localhost:4000/post/我胡汉三回来了">
        </link>
        <updated>2017-12-17T12:09:00.000Z</updated>
        <summary type="html"><![CDATA[<h3 id="新的开始我胡汉三又回来了">新的开始，我胡汉三又回来了！</h3>
<p>前几个月原域名被墙，导致许多朋友都上不来.</p>
<p>在经过一段时间的忙碌之后，终于有空闲的时间来修复了，在这里给大家说一声抱歉。</p>
<p>不过，这都不重要！重要的是我终于回来了！并且还做了一些微小的改动。</p>
]]></summary>
        <content type="html"><![CDATA[<h3 id="新的开始我胡汉三又回来了">新的开始，我胡汉三又回来了！</h3>
<p>前几个月原域名被墙，导致许多朋友都上不来.</p>
<p>在经过一段时间的忙碌之后，终于有空闲的时间来修复了，在这里给大家说一声抱歉。</p>
<p>不过，这都不重要！重要的是我终于回来了！并且还做了一些微小的改动。</p>
<!--more-->
<figure data-type="image" tabindex="1"><img src="https://i.loli.net/2018/03/31/5abf6be5c37d6.png" alt="骄傲"></figure>
<h3 id="域名">域名</h3>
<p>由于之前的域名被墙了，所以把 <code>nayo.moe</code> 换成了 <code>ikozn.com</code>。</p>
<h3 id="博客程序">博客程序</h3>
<p>从 WordPress 换到了 Hexo,并且托管于 Coding，所有文章都又Markdown编写，实际使用起来还是不错的。</p>
<p>这次迁移之后，加上了<a href="http://www.google.com/analytics/">Google Analytics </a>的网站统计服务。</p>
<p>但是这都 <strong>不! 重! 要!</strong></p>
<p>最最最最最重要的是，这个可爱的看板娘！！！</p>
<figure data-type="image" tabindex="2"><img src="https://img.ikozn.com/images/AbMa.png" alt="看板娘"></figure>
<figure data-type="image" tabindex="3"><img src="https://img.ikozn.com/images/AmJ2.jpg" alt=""></figure>
<p>哎呀好可爱！</p>
<p>这可是费了我九牛二虎之力才弄上来的</p>
<p>对于一个不会开发的运维小萌新来说，这简直是个奇迹！</p>
<h3 id="博客名">博客名</h3>
<p>由于域名都换了，博客名自然而然的也换成了Ikozn,图床也就直接叫图床好了！</p>
<h3 id="文章">文章</h3>
<p>暂时只恢复了一些文章用于测试，之后会陆续的恢复更多的文章。</p>
<p>有一些质量不是很好的旧文章，和一些转载的文章，都删了，留下来也没有什么意义。</p>
<figure data-type="image" tabindex="4"><img src="https://img.ikozn.com/images/A6eJ.jpg" alt=""></figure>
<h3 id="最后">最后</h3>
<p>目前所有的子站</p>
<p><a href="https://img.ikozn.com">图床</a></p>
<p><a href="https://cloud.ikozn.com">Cloud</a></p>
<p><s><a href="https://l4d2.ikozn.com">L4D2摸鱼服</a></s></p>
<p><s><a href="https://minecraft.ikozn.com">Minecraft摸鱼服</a></s></p>
<p><s><a href="https://BBS.ikozn.com">论坛</a></s></p>
]]></content>
    </entry>
    <entry>
        <title type="html"><![CDATA[[科普]IP地址、子网划分到底是个啥？]]></title>
        <id>http://localhost:4000/post/科普-IP地址、子网划分到底是个啥？</id>
        <link href="http://localhost:4000/post/科普-IP地址、子网划分到底是个啥？">
        </link>
        <updated>2017-12-15T10:02:04.000Z</updated>
        <summary type="html"><![CDATA[<h3 id="什么是ip">什么是IP</h3>
<p>IP地址就是<code>网络设备</code>在网络中通信所使用的地址，将通信的数据包比作快递包裹，那么IP地址就相当于你在快递包上填的发货与收货地址。</p>
]]></summary>
        <content type="html"><![CDATA[<h3 id="什么是ip">什么是IP</h3>
<p>IP地址就是<code>网络设备</code>在网络中通信所使用的地址，将通信的数据包比作快递包裹，那么IP地址就相当于你在快递包上填的发货与收货地址。</p>
<!--more-->
<p>两条设备需要互相知道对方的地址，才能进行通信。</p>
<p>一般IP地址写作<code>192.168.10.1</code>这样的形式</p>
<p>一个IP地址由三个点分成四个小块，每个小块里都有一个十进制数来表示地址.</p>
<p>所以这种表达IP地址的方式叫做点分十进制,也是我们使用最多的方式.</p>
<blockquote>
<p>Q：那有点分十进制这种表示方法，那是不是还有别的？</p>
<p>A：是的呀，你真鸡儿聪明，往下看。</p>
</blockquote>
<h4 id="二进制的ip">二进制的IP</h4>
<p>IP地址原本的面目是下面这个样子的</p>
<p><code>11000000101010000000101000000001</code></p>
<p>这就是IP地址的二进制表示方法，又臭又长。</p>
<blockquote>
<p>Q：什么鬼呀？！二进制是啥玩意啊？！</p>
<p>A：你丫自己百度去！！</p>
<p>Q：这一串长长的都特喵的是啥玩意？!!</p>
<p>A：这就是把IP地址的点分十进制表示法进制转换成二进制之后的样子啊~</p>
<p>Q：妈耶！这么长记个鬼噢</p>
<p>A：就是因为长，所以才需要点分十进制表示法嘛.</p>
</blockquote>
<p>IP地址的类别再这里不做介绍，有兴趣了解的自行百度</p>
<hr>
<h3 id="ip的表示方法">IP的表示方法</h3>
<h4 id="字节">字节</h4>
<p>首先引入一个概念<code>字节</code></p>
<p>计算机中数据储存最小的单位是<code>位</code>(Bit)，每一个二进制位占一个位。每8位为一<code>字节</code>(Byte)</p>
<p>比如<code>11000</code>这就有5位二进制，就占了5个Bit。</p>
<p>我们再回来看IP地址</p>
<p><code>11000000101010000000101000000001</code></p>
<p>一个IP地址最长为32位二进制,这个地址刚好占了32位。</p>
<p>那么占了多少个字节呢？</p>
<p>来一波简单的计算，<code>32÷8=4</code> 哇哦，四个字节哎.</p>
<blockquote>
<p>Q：点分十进制好像也是把IP分成4个小块哎！莫非...它们之间有什么不可告人的？..</p>
<p>A：妈耶！是有关系冇错，但是不可告人是什么鬼哦？！</p>
</blockquote>
<h4 id="ip地址二-十进制之间的转换">IP地址二、十进制之间的转换</h4>
<p>因为二进制的IP地址贼鸡儿长，所以出现了点分十进制的表示法，方便使用与记忆</p>
<p>我们把一个完整的IP地址使用<code>.</code>分为4个小块，每个小块一个字节。</p>
<p>然后贼鸡儿长的</p>
<p><code>11000000101010000000101000000001</code></p>
<p>就变成了</p>
<p><code>11000000</code>.<code>10101000</code>.<code>00001010</code>.<code>00000001</code></p>
<p>这表示法就叫做点分二进制.由点分隔开来，每个小块里的数都为二进制</p>
<blockquote>
<p>再引入几个概念,<code>第一字节</code> <code>第二字节</code> <code>第三字节</code> <code>第四字节</code></p>
<blockquote>
<p>注意，这个概念是我自己瞎鸡儿搞出来的，方便记忆</p>
</blockquote>
<table>
<thead>
<tr>
<th>11000000</th>
<th>10101000</th>
<th>00001010</th>
<th>00000001</th>
</tr>
</thead>
<tbody>
<tr>
<td>第一字节</td>
<td>第二字节</td>
<td>第三字节</td>
<td>第四字节</td>
</tr>
</tbody>
</table>
<p>如上表所示，因为每个小块为8位二进制，而8位二进制正好为1字节。</p>
<p>所以我第一个小块叫做第一字节，第二个小块叫做第二个字节，以此类推。</p>
</blockquote>
<p>我们把每个字节都转成10进制</p>
<p><strong>第一字节转换成十进制</strong>	<code>192</code></p>
<p><strong>第二字节转换成十进制</strong>	<code>168</code></p>
<p><strong>第三字节转换成十进制</strong>	<code>10</code></p>
<p><strong>第四字节转换成十进制</strong>	<code>1</code></p>
<p>最后再合起来就得到了<code>192.168.10.1</code></p>
<p>想要把点分十进制表示的IP转成十进制只需要反着来就好了</p>
<hr>
<h3 id="一个字节能表达的最大值">一个字节能表达的最大值</h3>
<p>IP地址在十进制的形态下，每字节的值最大只能为255.</p>
<p>IP地址究其本质，还是从二进制转换而来的.</p>
<p>由于每个字节也就只有8位二进制</p>
<p>最小为<code>00000000</code>,最大为<code>11111111</code></p>
<p><code>00000000</code>转换成十进制是0</p>
<p><code>11111111</code>转换成十进制是255</p>
<p>所以每个字节(8位二进制)所能表达值的范围就是 <code>00000000</code>-<code>11111111</code>，转换成十进制也就是 <code>0</code>-<code>255</code></p>
<hr>
<h3 id="掩码与子网">掩码与子网</h3>
<p>通常配置IP地址的时候，还需要配置一个子网掩码。</p>
<p>IP与子网掩码是成对出现的,掩码的作用就是用于判断一个IP地址，是属于哪个子网的。</p>
<h4 id="子网">子网</h4>
<p>之前谈IP地址的时候我们讲过，IP地址相当于你在快递包上填的发货与收货地址。</p>
<p>那么地址一般写的都是<code>A省B市C区D路E小区F单元G号房间</code> 吧，总不能在地址上直接写G房间呀。</p>
<p>所以呢，为了方便管理，一个国家分为了各个省，接着各个省下又分为了各个市</p>
<p>以此类推，就出现了区、路(街)、小区、单元、房间号的概念，都是将一个大的<strong>区域</strong>划分为一个相对小的<strong>区域</strong>。</p>
<p>同样的，IP网络也可以划分成更小的网络，这些更小的网络，我们就称之为<strong>子网</strong></p>
<blockquote>
<p>PS:收货地址并不一定都是这么写，比如我就不一定会精细的写到某某房间</p>
<p>这里只是一个方便理解的比喻，不要钻牛角尖</p>
</blockquote>
<h4 id="掩码">掩码</h4>
<p>因为出现了子网的概念，所以子网掩码就应运而生了。</p>
<p>子网掩码的作用,就是用于判断一个IP地址，是属于哪个子网的。</p>
<h5 id="掩码的表示">掩码的表示</h5>
<p>相信大家最常见的掩码就是 <code>255.255.255.0</code>了吧</p>
<p>掩码转成十进制时候，其实也是点分十进制的表示方式.</p>
<p>转换成二进制就是</p>
<p><code>11111111.11111111.11111111.00000000</code></p>
<p>发现了吗，从左到右全都是<code>1</code></p>
<p>掩码是从左至右由<strong>连续的</strong><code>1</code>组成，不能断开</p>
<p>例如</p>
<p><code>11111111.11110111.11111111.00000000</code></p>
<p>就不是一个掩码</p>
<p>还有一种表示方法为 <code>IP地址</code>/<code>掩码长度</code></p>
<p>比如 <code>192.168.10.1</code>/<code>24</code></p>
<p>就表示 IP地址为 <code>192.168.10.1</code> 而掩码为 <code>11111111.11111111.11111111.00000000</code>（24个1）</p>
<p>也就是<code>255.255.255.0</code></p>
<h5 id="网络位-主机位">网络位 主机位</h5>
<p>简单的说，网络位就是掩码中<code>1</code>的部分，而主机位就是掩码中<code>0</code>的部分</p>
<p>当想知道一个地址的所属哪个子网，也就是获取一个地址的网络号时。</p>
<p>我们使用掩码跟IP地址进行<code>与</code>运算</p>
<p>而想知道主机号的时候，就将掩码取后再跟IP地址进行<code>与</code>运算</p>
<blockquote>
<p><code>与</code>运算是逻辑运算</p>
<p><code>1</code>与任何数相<code>与</code>得到任何数</p>
<p><code>0</code>与任何数相<code>与</code>都得<code>0</code></p>
</blockquote>
<p><strong>举个例子</strong></p>
<p>假设现在有一个IP地址为 <code>192.168.10.1/24</code></p>
<p>为了方便讲解，我们先列一个表</p>
<table>
<thead>
<tr>
<th style="text-align:center">掩码</th>
<th style="text-align:left">11111111</th>
<th style="text-align:left">11111111</th>
<th style="text-align:left">11111111</th>
<th style="text-align:right">00000000</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">IP地址二进制</td>
<td style="text-align:left">11000000</td>
<td style="text-align:left">10101000</td>
<td style="text-align:left">00001010</td>
<td style="text-align:right">00000001</td>
</tr>
<tr>
<td style="text-align:center">IP地址十进制</td>
<td style="text-align:left">192</td>
<td style="text-align:left">168</td>
<td style="text-align:left">10</td>
<td style="text-align:right">1</td>
</tr>
<tr>
<td style="text-align:center">字节</td>
<td style="text-align:left">第一字节</td>
<td style="text-align:left">第二字节</td>
<td style="text-align:left">第三字节</td>
<td style="text-align:right">第四字节</td>
</tr>
</tbody>
</table>
<p>其中，掩码第一到三字节都为网络位，第四字节为主机位</p>
<h6 id="获取网络号">获取网络号</h6>
<p>按照上面说的.将掩码与IP地址相<code>与</code>，就得到了二进制的网络号</p>
<table>
<thead>
<tr>
<th>掩码</th>
<th style="text-align:center">11111111</th>
<th style="text-align:center">11111111</th>
<th style="text-align:center">11111111</th>
<th style="text-align:center">00000000</th>
</tr>
</thead>
<tbody>
<tr>
<td>IP地址</td>
<td style="text-align:center">11000000</td>
<td style="text-align:center">10101000</td>
<td style="text-align:center">00001010</td>
<td style="text-align:center">00000001</td>
</tr>
<tr>
<td>网络号</td>
<td style="text-align:center">11000000</td>
<td style="text-align:center">10101000</td>
<td style="text-align:center">00001010</td>
<td style="text-align:center">00000000</td>
</tr>
</tbody>
</table>
<p>接着再将相与后的二进制转换成点分十进制，接着我们就得到网络号:<code>192.168.10.0/24</code></p>
<table>
<thead>
<tr>
<th style="text-align:center">11000000</th>
<th style="text-align:center">10101000</th>
<th style="text-align:center">00001010</th>
<th style="text-align:center">00000000</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">192</td>
<td style="text-align:center">168</td>
<td style="text-align:center">10</td>
<td style="text-align:center">0</td>
</tr>
</tbody>
</table>
<h6 id="例获取主机号">例获取主机号</h6>
<p>首先，将掩码取反，也就是将<code>1</code>和<code>0</code>反过来，得到反掩码</p>
<table>
<thead>
<tr>
<th style="text-align:center">原掩码</th>
<th style="text-align:center">11111111</th>
<th style="text-align:center">11111111</th>
<th style="text-align:center">11111111</th>
<th>00000000</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center">反掩码</td>
<td style="text-align:center">00000000</td>
<td style="text-align:center">00000000</td>
<td style="text-align:center">00000000</td>
<td>11111111</td>
</tr>
</tbody>
</table>
<p>接着再用反掩码跟IP地址相<code>与</code>，得到主机号的二进制</p>
<table>
<thead>
<tr>
<th>反掩码</th>
<th>00000000</th>
<th>00000000</th>
<th>00000000</th>
<th>11111111</th>
</tr>
</thead>
<tbody>
<tr>
<td>IP地址</td>
<td>11000000</td>
<td>10101000</td>
<td>00001010</td>
<td>00000001</td>
</tr>
<tr>
<td>主机号</td>
<td>00000000</td>
<td>00000000</td>
<td>00000000</td>
<td>00000001</td>
</tr>
</tbody>
</table>
<p>再将结果转成10进制，于是我们就可以得到主机号 :<code>1</code></p>
<h5 id="特殊的地址">特殊的地址</h5>
<p>在子网中，有三钟地址</p>
<p>分别是 <strong>网络号</strong>、<strong>广播地址</strong>、<strong>主机地址</strong></p>
<h6 id="网络号">网络号</h6>
<p>顾名思义，看到名字就明白了，它的作用就是表示一个子网、网段的一个地址.</p>
<p>定义:主机位全<code>0</code>的地址</p>
<p>例如:<code>192.168.10.0/24</code></p>
<h6 id="广播地址">广播地址</h6>
<p>这个刚入门也许有些难以理解</p>
<p>其实这就是<strong>主机</strong>同时向<strong>同个子网</strong>中的<strong>其他所有</strong>主机发送信息时使用的地址</p>
<p>定义:主机全<code>1</code>的地址</p>
<p>例如:<code>192.168.10.255/24</code></p>
<h6 id="主机地址">主机地址</h6>
<p>这个也很好理解，用于表示子网中一台主机的地址</p>
<p>定义:主机位既不是全<code>0</code>,也不是全<code>1</code>的地址</p>
<blockquote>
<p>如果将IP地址比喻做酒店房间地址的话</p>
<p>网络号相当于楼层号，表示一个<strong>楼层</strong></p>
<p>主机地址表示这层楼中的<strong>一间房间</strong></p>
<p>而广播地址，则表示这个楼层中的<strong>所有房间</strong></p>
<p><strong>楼层</strong>包含这层楼的<strong>所有房间</strong></p>
<p><strong>所有房间</strong>包含<strong>一间房间</strong></p>
</blockquote>
<hr>
<h3 id="子网划分">子网划分</h3>
<p><code>待填坑</code></p>
<h4 id="子网划分原理">子网划分原理</h4>
<h6 id="根据主机数划分子网">根据主机数划分子网</h6>
<p><code>待填坑</code></p>
<h6 id="根据子网数划分子网">根据子网数划分子网</h6>
<p><code>待填坑</code></p>
<h4 id="快速子网划分">快速子网划分</h4>
<h6 id="快速划分子网原理">快速划分子网原理</h6>
<p><code>待填坑</code></p>
]]></content>
    </entry>
    <entry>
        <title type="html"><![CDATA[[Note]论如何食用KMS激活]]></title>
        <id>http://localhost:4000/post/笔记-论如何食用KMS激活</id>
        <link href="http://localhost:4000/post/笔记-论如何食用KMS激活">
        </link>
        <updated>2017-12-15T09:56:40.000Z</updated>
        <summary type="html"><![CDATA[<h3 id="kms-服务器地址">KMS 服务器地址</h3>
<p>推荐使用<a href="https://03k.org/">零散坑</a>的KMS激活服务</p>
<pre><code>kms.03k.org
</code></pre>
]]></summary>
        <content type="html"><![CDATA[<h3 id="kms-服务器地址">KMS 服务器地址</h3>
<p>推荐使用<a href="https://03k.org/">零散坑</a>的KMS激活服务</p>
<pre><code>kms.03k.org
</code></pre>
<!--more-->
<h3 id="kms-version">Kms version</h3>
<pre><code>vlmcsd-1108-2017-01-19-Hotbird64
</code></pre>
<h3 id="正片">正片</h3>
<p>一般来说，只要确保的下载的是 VL 批量版本并且没有手动安装过任何 key， 你只需要使用管理员权限运行 cmd 执行一句命令就足够：</p>
<pre><code>slmgr /skms kms.03k.org
</code></pre>
<p>然后去计算机属性或者控制面板其他的什么的地方点一下激活就好了。<br>
当然，如果你懒得点，可以多打一句命令手动激活：</p>
<pre><code>slmgr /ato
</code></pre>
<p>这句命令的意思是，马上对当前设置的 key 和服务器地址等进行尝试激活操作。</p>
<p>kms 激活的前提是你的系统是批量授权版本，即 VL 版，一般企业版都是 VL 版，专业版有零售和 VL 版，家庭版旗舰版 OEM 版等等那就肯定不能用 kms 激活。一般建议从 http://msdn.itellyou.cn 上面下载系统 VL 版本的镜像一般内置 GVLK key，用于 kms 激活。如果你手动输过其他 key，那么这个内置的 key 就会被替换掉，这个时候如果你想用 kms，那么就需要把 GVLK key 输回去。首先， 到 https://technet.microsoft.com/en-us/library/jj612867.aspx 获取你对应版本的 KEY 如果打不开下面有对应的</p>
<p>如果不知道自己的系统是什么版本，可以运行以下命令查看系统版本：</p>
<pre><code>wmic os get caption
</code></pre>
<p>得到对应 key 之后，使用管理员权限运行 cmd 执行安装 key：</p>
<pre><code>slmgr /ipk xxxxx-xxxxx-xxxxx-xxxxx
</code></pre>
<p>然后跟上面说的一样设置 kms 服务器地址，激活。</p>
<h3 id="一句命令激活-office">一句命令激活 OFFICE</h3>
<p>首先你的 OFFICE 必须是 VOL 版本，否则无法激活。 找到你的 office 安装目录，比如</p>
<pre><code>C:\Program Files (x86)\Microsoft Office\Office16
</code></pre>
<p>64 位的就是</p>
<pre><code>C:\Program Files\Microsoft Office\Office16
</code></pre>
<p>office16 是 office2016，office15 就是 2013，office14 就是 2010. 然后目录对的话，该目录下面应该有个 OSPP.VBS。 接下来我们就 cd 到这个目录下面，例如：</p>
<pre><code>cd C:\Program Files (x86)\Microsoft Office\Office16
</code></pre>
<p>然后执行注册 kms 服务器地址：</p>
<pre><code>cscript ospp.vbs /sethst:kms.03k.org
</code></pre>
<p>/sethst 参数就是指定 kms 服务器地址。 一般 ospp.vbs 可以拖进去 cmd 窗口，所以也可以这么弄：</p>
<pre><code>cscript &quot;C:\Program Files (x86)\Microsoft Office\Office16\OSPP.VBS&quot; /sethst:kms.03k.org
</code></pre>
<p>一般来说，“一句命令已经完成了”，但一般 office 不会马上连接 kms 服务器进行激活，所以我们额外补充一条手动激活命令：</p>
<pre><code>cscript ospp.vbs /act
</code></pre>
<p>如果提示看到 successful 的字样，那么就是激活成功了，重新打开 office 就好。 如果遇到报错，请检查：</p>
<p>你的系统/OFFICE 是否是批量 VL 版本<br>
是否以管理员权限运行 CMD<br>
你的系统/OFFICE 是否修改过 KEY/未安装 GVLK KEY<br>
检查你的网络连接<br>
服务器繁忙，多试试（点击检查 KMS 服务是否可用）<br>
根据出错代码自己搜索出错原因</p>
<p><a href="https://technet.microsoft.com/en-us/library/jj612867.aspx">Windows GVLK 密钥对照表（KMS 激活专用）</a></p>
]]></content>
    </entry>
    <entry>
        <title type="html"><![CDATA[ 沉迷剑三 ]]></title>
        <id>http://localhost:4000/post/沉迷剑三</id>
        <link href="http://localhost:4000/post/沉迷剑三">
        </link>
        <updated>2017-06-24T09:11:29.000Z</updated>
        <content type="html"><![CDATA[<figure data-type="image" tabindex="1"><img src="https://i.loli.net/2018/03/31/5abf6bb365875.jpg" alt=""></figure>
<p>自在逍遥！</p>
<!--more-->]]></content>
    </entry>
</feed>